**Pandas**

In [151]:
import pandas as pd

**Series**:lets make our own series(One-dimensional ndarray with axis labels)

We want to add ages with their labels:

In [152]:
age=pd.Series([10,20,30,40],index=['age1','age2','age3','age4'])
print(age)
print("age3:",age.age3)

age1    10
age2    20
age3    30
age4    40
dtype: int64
age3: 30

If we want to filter the data:

In [153]:
filtered=age[age>20]
filtered

age3    30
age4    40
dtype: int64

Getting the values as numpy array:

In [154]:
print("values:",age.values)

values: [10 20 30 40]

Getting the indices of the series:

In [155]:
age.index

Index(['age1', 'age2', 'age3', 'age4'], dtype='object')

We can change the indices:

In [156]:
age.index = ['A1','A2','A3','A4']
age.index

Index(['A1', 'A2', 'A3', 'A4'], dtype='object')

**Data Frame**

First,import numpy:

In [157]:
import numpy as np

In [158]:
df=np.array([[20,10,8],[25,8,10],[27,5,3],[30,9,7]])#type :array of int32 format
df

array([[20, 10,  8],
       [25,  8, 10],
       [27,  5,  3],
       [30,  9,  7]])

Change the variable 'df' to DataFrame:

**Note:**DataFrame is pandas object- we can manipulate our data with it.

In [159]:
data_set=pd.DataFrame(df)#type :DataFrame format
data_set

    0   1   2
0  20  10   8
1  25   8  10
2  27   5   3
3  30   9   7

Define labels indices of the variable 'data_set':

In [160]:
data_set=pd.DataFrame(df,index=['student1','student2','student3','student4'])#define indices for rows
print(data_set)

           0   1   2
student1  20  10   8
student2  25   8  10
student3  27   5   3
student4  30   9   7

Define for labels indices for columns:

In [161]:
data_set=pd.DataFrame(df,index=['student1','student2','student3','student4'],columns=['age','grade1','grade2'])
data_set

          age  grade1  grade2
student1   20      10       8
student2   25       8      10
student3   27       5       3
student4   30       9       7

Adding another column to 'data_set';
we want to add column called 'grade3' and define grades of this column:

In [162]:
data_set['grade3']=[9,6,7,10]
data_set

          age  grade1  grade2  grade3
student1   20      10       8       9
student2   25       8      10       6
student3   27       5       3       7
student4   30       9       7      10

**loc and iloc methods**

This section is very usfull for preprocessing the data.
We will access the values of the data with index or labels.

[Rows,columns]

We use 'loc' method when we want to select special objects or series(by labels) in our data frame.

use 'loc' method if you know the labels(index name).

In [163]:
data_set.loc["student2"]

age       25
grade1     8
grade2    10
grade3     6
Name: student2, dtype: int64

With **iloc** method- use indices to get specific values in the data frame:

['student2','grade3']-->6

In [164]:
data_set.iloc[1][3]# 6
data_set.iloc[1,3] #another way

6

If you need all the rows and one column

':' = will give you all the rows/columns.

all rows and index 0 (['age'] column)

In [165]:
data_set.iloc[:,0]

student1    20
student2    25
student3    27
student4    30
Name: age, dtype: int64

If you need all the rows and specific columns:

all the rows (':') and two columns ['grade1','grade2']
column index 1 (['grade1']) and column index 2 (['grade2'],not including index 3)

In [166]:
filtered_data_set=data_set.iloc[:,1:3]
filtered_data_set

          grade1  grade2
student1      10       8
student2       8      10
student3       5       3
student4       9       7

**Drop and change the data**

Use 'drop' method to drop the row or column you want to.

First, we need to mention what to drop- row or column. To define this use the 'axis=' when declare the 'drop' method.
'axis=1' will drop in vertical way(column).

Lest drop from the data frame ['grade1']

Data frame before drop:

In [167]:
data_set

          age  grade1  grade2  grade3
student1   20      10       8       9
student2   25       8      10       6
student3   27       5       3       7
student4   30       9       7      10

Data frame after drop:

In [168]:
data_set.drop('grade1',axis=1)

          age  grade2  grade3
student1   20       8       9
student2   25      10       6
student3   27       3       7
student4   30       7      10

Replace values in the data frame-
use the 'replace' method.

Replace(number_to_replace,new_value).
We will replace the three values of 10 to three values of 12:

In [169]:
data_set=data_set.replace(10,12)
data_set

          age  grade1  grade2  grade3
student1   20      12       8       9
student2   25       8      12       6
student3   27       5       3       7
student4   30       9       7      12

We can use dictionary for replace many different values:

In [170]:
data_set=data_set.replace({12:10,9:30})
data_set

          age  grade1  grade2  grade3
student1   20      10       8      30
student2   25       8      10       6
student3   27       5       3       7
student4   30      30       7      10

**If you have a big data set you can view the data quickly by using 'head' or 'tail' method inorder to understand it.**

In [171]:
data_set.head(2) #seing only the first 2 rows of the dataset.

          age  grade1  grade2  grade3
student1   20      10       8      30
student2   25       8      10       6

In [172]:
data_set.tail(2) #seing only the last 2 rows of the dataset.

          age  grade1  grade2  grade3
student3   27       5       3       7
student4   30      30       7      10

**Sorting your dataset**

You can sort by value or sort by index.

There are two methods:
'sort_values' and 'sort_index'
'axis=0' is to rows, 'axis=1' is to columns.

'sort_values' is for sorting the labels,need to define what label we want to sort.

Also, need to set if we want to sort in ascending order or descending order.

Data set before 'sort_values':

In [173]:
data_set

          age  grade1  grade2  grade3
student1   20      10       8      30
student2   25       8      10       6
student3   27       5       3       7
student4   30      30       7      10

Data set after 'sort_values':

In [174]:
data_set.sort_values(['grade2'],axis=0,ascending=True) #ascending=False will sort in descending order

          age  grade1  grade2  grade3
student3   27       5       3       7
student4   30      30       7      10
student1   20      10       8      30
student2   25       8      10       6

Now we will sort by indices:

In [175]:
data_set.sort_index(axis=0,ascending=False)#descending order

          age  grade1  grade2  grade3
student4   30      30       7      10
student3   27       5       3       7
student2   25       8      10       6
student1   20      10       8      30

In [176]:
data_set.sort_index(axis=0,ascending=True)#ascending order

          age  grade1  grade2  grade3
student1   20      10       8      30
student2   25       8      10       6
student3   27       5       3       7
student4   30      30       7      10

In [189]:
data_set.sort_index(axis=1,ascending=False)#sorting columns,ascending order

          grade3  grade2  grade1  age
student1      30       8      10   20
student2       6      10       8   25
student3       7       3       5   27
student4      10       7      30   30

_________________________

**Load date from CSV file into pandas**

Note:pandas allows to read also txt and excel file

In [178]:
data=pd.read_csv('Data_Set.csv')
data # need to "clean" the data.

,Name of the data = Home Consumption,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,Unit = kW and $/kW,NaN,NaN,NaN,NaN,NaN
1,Time,E_Plug,E_Heat,Price,Temperature,No. Occupants
2,1,24,28,10,-15,12
3,2,17,32,12,-17,12
4,3,16,34,11,-19,12
5,3,16,34,11,-19,12
6,4,16,33,12,-18,12
7,5,16,30,10,-14,12
8,6,16,31,10,-16,12
9,7,19,28,14,-14,12
10,8,22,29,12,-15,9
11,9,25,26,12,-12,8
12,10,26,24,14,-8,8
13,11,27,20,14,-4,8
14,12,30,19,16,0,5
15,13,30,19,16,0,4
16,14,NaN,13,17,2,4
17,15,27,14,17,3,4
18,16,27,16,17,2,6
19,17,28,-4,18,0,8
20,18,33,26,20,-6,9
21,19,42,32,21,-8,10
22,20,120,33,21,-12,12
23,21,47,32,21,-16,12
24,22,44,30,22,-18,12
25,23,36,35,!,-19,12
26,24,37,36,18,-22,12

Read headers

In [179]:
data.columns

Index(['Name of the data = Home Consumption', 'Unnamed: 1', 'Unnamed: 2',
       'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5'],
      dtype='object')

Read each column

In [180]:
data[['Unnamed: 1','Unnamed: 2']][0:6]

  Unnamed: 1 Unnamed: 2
0        NaN        NaN
1     E_Plug     E_Heat
2         24         28
3         17         32
4         16         34
5         16         34

Read each row

In [181]:
data.iloc[2:4]

,Name of the data = Home Consumption,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
2,1,24,28,10,-15,12
3,2,17,32,12,-17,12

Read a specific location [R,C]

In [182]:
data.iloc[2,1]

'24'

Iterate row by row (can access any data you wnat)

In [183]:
for index,row in data.iterrows():
    print(index,row['Unnamed: 1'],"\n")

0 nan

1 E_Plug

2 24

3 17

4 16

5 16

6 16

7 16

8 16

9 19

10 22

11 25

12 26

13 27

14 30

15 30

16 nan

17 27

18 27

19 28

20 33

21 42

22 120

23 47

24 44

25 36

26 37

Getting rows based on a specific condition

In [184]:
data.loc[data['Unnamed: 1'] == "16"]

,Name of the data = Home Consumption,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
4,3,16,34,11,-19,12
5,3,16,34,11,-19,12
6,4,16,33,12,-18,12
7,5,16,30,10,-14,12
8,6,16,31,10,-16,12

High Level description of your data (min,max,mean,std dev,etc.)

In [185]:
data.describe()

,Name of the data = Home Consumption,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
count,27,25,26,26,26,26
unique,26,18,18,12,15,8
top,3,16,32,12,0,12
freq,2,5,3,4,3,13

Sorting in ascending order and descending order at the same time:

we can write 'ascending=[1,0]' to specify in which way we want to sort each column.

First column will be in ascending order (1) and the second column will be in descending order (0)

In [186]:
data.sort_values(['Unnamed: 1','Unnamed: 5'],ascending=[1,0])

,Name of the data = Home Consumption,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
22,20,120,33,21,-12,12
4,3,16,34,11,-19,12
5,3,16,34,11,-19,12
6,4,16,33,12,-18,12
7,5,16,30,10,-14,12
8,6,16,31,10,-16,12
3,2,17,32,12,-17,12
9,7,19,28,14,-14,12
10,8,22,29,12,-15,9
2,1,24,28,10,-15,12
11,9,25,26,12,-12,8
12,10,26,24,14,-8,8
13,11,27,20,14,-4,8
18,16,27,16,17,2,6
17,15,27,14,17,3,4
19,17,28,-4,18,0,8
14,12,30,19,16,0,5
15,13,30,19,16,0,4
20,18,33,26,20,-6,9
25,23,36,35,!,-19,12
26,24,37,36,18,-22,12
21,19,42,32,21,-8,10
24,22,44,30,22,-18,12
23,21,47,32,21,-16,12
1,Time,E_Plug,E_Heat,Price,Temperature,No. Occupants
16,14,NaN,13,17,2,4
0,Unit = kW and $/kW,NaN,NaN,NaN,NaN,NaN

**Saving our modified data**

In [187]:
data.to_csv('modified_data.csv',index=False)

In [188]:
data.to_csv('modified_data.txt',index=False,sep='\t')#txt format